test/performance/todois.performance.yml
config:
    target: "https://api.todoist.com"
    phases: 
        - duration: 1
          arrivalRate: 5
          name: "Warm up"
    defaults: 
        headers:
            Authorization: Bearer "{{ $processEnvironment.TOKEN }}"
            Content-Type: application/json
    variables:
        url_tasks: 
            - "/rest/v1/tasks"
        task_name:
            - "task performance"

before:
  flow:
    - log: "Creating tasks before getting them"        
    - post:
        url: "{{ url_tasks }}"
        json:
            content: "{{ task_name }}"
        capture:
            json: "$.id"
            as: "id_task"
        log: "Task id is {{id_task}}"
        expect:
        - statusCode: 200                

scenarios:
    - flow:
          
        #get active tasks
        - get:
            url: "{{ url_tasks }}"
            expect:
                - statusCode: 200


        #Create a new task
        - post:
            url: "{{ url_tasks }}"
            json:
                content: "{{ task_name }}"
            capture:
                json: "$.id"
                as: "id_task"
            expect:
                - statusCode: 200
        - log: "Task id is {{id_task}}"

        #Get active task
        - get:
            url: "{{ url_tasks }}/{{ id_task }}"
            capture:
                json: "$.content"
                as: "content"
            expect:
                - statusCode: 200

        #Update tasks 
        - post:
            url: "{{ url_tasks }}/{{ id_task }}"
            json:
                content: "update"
            expect:
                - statusCode: 204

        #Change status to complete 
        - post:
            url: "{{ url_tasks }}/{{ id_task }}/close"
            json:
                content: "close"    
            expect:
                - statusCode: 204
        #Reopen task
        - post:
            url: "{{ url_tasks }}/{{ id_task }}/reopen"
            json:
                content: "reopen" 
            expect:
                - statusCode: 204       

        #delete task 
        - delete:
            url: "{{ url_tasks }}/{{ id_task }}"
            capture:
                json: "$"
                as: "tasks"
            expect:
                - statusCode: 204